local/modules/yauheni.dpd/sdk/src/lib/API/Client/logs/acb4b68dd2bf21e0e550dd8d974c30f5.logs

LOCATION: 
http://ws.dpd.ru:80/services/order2
REQUEST : 
<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://dpd.ru/ws/order2/2012-04-04"><SOAP-ENV:Body><ns1:createOrder><orders><auth><clientNumber>1104009121</clientNumber><clientKey>CA461909F1DFED320BFBCA5B90A002AD5756D6BF</clientKey></auth><header><datePickup>2020-03-24</datePickup><senderAddress><name>ООО "Сэльвин-Логистик"</name><terminalCode>MSQ</terminalCode><contactFio>BH.BY ALL.BH.BY</contactFio><contactPhone>+375447480824</contactPhone><contactEmail></contactEmail><needPass>false</needPass></senderAddress><pickupTimePeriod>9-18</pickupTimePeriod></header><order><orderNumberInternal>20482</orderNumberInternal><serviceCode>CSM</serviceCode><serviceVariant>ТД</serviceVariant><cargoNumPack>1</cargoNumPack><cargoWeight>1</cargoWeight><cargoVolume>0.004</cargoVolume><cargoRegistered>false</cargoRegistered><cargoValue>85.19</cargoValue><cargoCategory>косметические товары</cargoCategory><receiverAddress><name>Жаркова Инна</name><countryName>Беларусь</countryName><region>Гомельская</region><city>Гомель</city><street>проспект победы</street><house>17</house><houseKorpus>а</houseKorpus><flat>37</flat><contactFio>Жаркова Инна</contactFio><contactPhone>375445587305</contactPhone><contactEmail></contactEmail><needPass>false</needPass></receiverAddress><extraService><esCode>НПП</esCode><param><name>sum_npp</name><value>85.19</value></param></extraService></order></orders></ns1:createOrder></SOAP-ENV:Body></SOAP-ENV:Envelope>

ANSWER  : 
<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns2:createOrderResponse xmlns:ns2="http://dpd.ru/ws/order2/2012-04-04"><return><orderNumberInternal>20482</orderNumberInternal><status>OrderPending</status><errorMessage>Заказ обрабатывается нашими сотрудниками. Не повторяйте оформление данного заказа.
---------------------
ORA-20815: Улица с названием  “Проспект Победы” неизвестна.</errorMessage></return></ns2:createOrderResponse></S:Body></S:Envelope>
