system/dpd/src/lib/API/Client/logs/1b5f52fb64662010e31e8722405ed408.logs

LOCATION: 
https://wstest.dpd.ru/services/order2
REQUEST : 
<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://dpd.ru/ws/order2/2012-04-04"><SOAP-ENV:Body><ns1:createOrder><orders><auth><clientNumber>1001027795</clientNumber><clientKey>182A17BD6FC5557D1FCA30FA1D56593EB21AEF88</clientKey></auth><header><datePickup>2023-02-28</datePickup><senderAddress><name>Склад в Москве</name><countryName>Россия</countryName><region>Москва</region><city>Москва</city><street>докукина 18</street><contactFio>Иван</contactFio><contactPhone>+71234567890</contactPhone><contactEmail>email@email.ru</contactEmail><needPass>false</needPass></senderAddress><pickupTimePeriod>9-18</pickupTimePeriod></header><order><orderNumberInternal>286</orderNumberInternal><serviceCode>CSM</serviceCode><serviceVariant>ДТ</serviceVariant><cargoNumPack>1</cargoNumPack><cargoWeight>1</cargoWeight><cargoVolume>0.002</cargoVolume><cargoRegistered>false</cargoRegistered><cargoCategory>содержимое отправки</cargoCategory><deliveryTimePeriod>9-18</deliveryTimePeriod><extraParam><name>source_of_order</name><value>WordPress</value></extraParam><extraParam><name>is_unique_marking</name><value>1</value></extraParam><receiverAddress><name>5556 456</name><terminalCode>3I97</terminalCode><contactFio>5556 456</contactFio><contactPhone>+71234567890</contactPhone><contactEmail>test@dpd.ru</contactEmail><needPass>false</needPass></receiverAddress><unitLoad><descript>Album</descript><declared_value>15</declared_value><npp_amount>15</npp_amount><without_vat>true</without_vat><count>1</count></unitLoad><unitLoad><descript>Доставка</descript><declared_value>0</declared_value><npp_amount>329.18</npp_amount><without_vat>true</without_vat><count>1</count></unitLoad></order></orders></ns1:createOrder></SOAP-ENV:Body></SOAP-ENV:Envelope>

ANSWER  : 
<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns2:createOrderResponse xmlns:ns2="http://dpd.ru/ws/order2/2012-04-04"><return><orderNumberInternal>286</orderNumberInternal><orderNum>RU079783454</orderNum><status>OK</status></return></ns2:createOrderResponse></S:Body></S:Envelope>
